// TODO
// базовые стили +
// header +
// navbar
// popup регистрации Reactjs-popup +
// popup входа Reactjs-popup +
// массив сообщений с ошибками +
// оформление ошибок + переделать инпуты? +
// constans переименовать в utils +
// перенести setFormTab в auth + refresh +
// имя и фамилия в форме регистраци

// главная - карточки
// главная - поиск
// главная - сортировка
// главная - остальное

// личный кабинет
// карточка
// редактор карточки
// комментарии
// новые комментарии
// отслеживать комментарии?
// закрыть комментарии

// footer